{
  "blogs": [
    {
      "id": "staff-planning-presentation",
      "title": "How Digital Twins support processes and decision making within retail",
      "authors": "Matúš Tomlein",
      "context": "Pygmalios",
      "date": "2021-07-14",
      "banner": "staff-planning-video.jpg",
      "perex": "I presented at the [Digital Twins Awareness workshop](https://www.comit.org.uk/digitaltwinsawareness) about our thoughts on the Digital Twins concept at Pygmalios. In our view, Digital Twins are virtual representations of physical stores that reflect their current and past events through the use of sensor data. They enable us to model what is going on at retail stores, predict their future state and optimize common processes.\n\nTo illustrate this concept, I explained it on a case that we have been working on for some time – generating optimized employee work schedules. Our solution uses traffic data collected from retail stores, information about employee availability, and common guidelines for workforce management. It applies AI solvers to suggest optimized employee schedules that best reflect the demand for employees while satisfying employee preferences and workforce rules."
    },
    {
      "id": "seelog2",
      "title": "Seelog 2: A Redesign Using SwiftUI",
      "authors": "Matúš Tomlein",
      "date": "2020-08-02",
      "banner": "seelog2-banner.jpeg",
      "perex": "In times when our travels are restricted, it is nice to look back on our past adventures and find new opportunities to explore in our surroundings. The new version of Seelog, Seelog 2, comes with a new look and more insights into your travels close and far. It is now available for [download on the App Store.](https://seelog.app)\n\nOn a technical level, the new UI of Seelog 2 was rewritten from scratch using SwiftUI. It was fun learning the new framework, and, despite being relatively new, it turned out to be pretty powerful. In fact, there is no remaining UIKit code in Seelog and SwiftUI even made it easier to create custom visualizations such as the new maps that are purely drawn using polygons and basic shapes in SwiftUI."
    },
    {
      "id": "covidmisinfo",
      "title": "CovidMis.info: Exploration of COVID-19 Fact Checks",
      "context": "MISDEED, FIIT STU",
      "authors": "Matúš Tomlein",
      "date": "2020-04-20",
      "banner": "blogs/covidmisinfo/graph.png",
      "perex": "Misinformation during the COVID-19 pandemic poses a serious threat to public health as well as spreads stigma and fear. Recognizing this threat, numerous fact checking sites continuously monitor misinformation related to the disease and publish information fact-checked by experts. Exploring this knowledge base of fact checks provides potential for better understanding how misinformation regarding COVID-19 evolves and relates to other content. CovidMis.info is a website that aims to support the exploration of fact checks and related Web articles. It builds on Monant, a platform for crawling and processing misinformation-related data from the Web. Based on the data, it provides visualizations of relations between fact checks and fact checks and Web articles."
    },
    {
      "id": "seelog-geotags",
      "title": "Seelog: Using Geotagged Photos to Track Your Travels",
      "authors": "Matúš Tomlein",
      "date": "2019-05-24",
      "banner": "seelog-banner.jpg",
      "perex": "Smartphones make it easy to track your steps, runs, sleep, or time spent using apps. But getting data on which countries, cities, timezones, and places you visited is a bigger challenge. Your main options are to log your travels manually, give third-parties access to your emails with travel reservations, or run apps that track your GPS location 24/7 for years. Suffice it to say that none of these options are great.\n\nThere is one obvious source of data that is rarely used: photos. Most people take photos when they travel, and many of them use smartphones or cameras that store geotags along with the photos. This is an amazing source of data as it doesn't require additional tracking or manual input, and many of us have already collected a good amount of the data without even thinking about it. Your photo library app can use the geotags to show you photos placed on a map, but there is so much more you can do with the data. For instance, I'd be interested in how many countries I visited last year versus the previous year, which cities I spent most time in, and which timezones I was in."
    },
    {
      "id": "pygmalios-trajectory-visualisation-skeletons",
      "title": "Visualisation of Shopper Trajectories Using “Skeletons” of Retail Stores",
      "authors": "Matúš Tomlein and Sára Kúťková",
      "context": "Pygmalios",
      "date": "2019-04-25",
      "banner": "blogs/pygmalios-aggregated-trajectories.png",
      "perex": "Having some large retail stores with lots of daily shoppers as customers at [Pygmalios](https://pygmalios.com/), we were faced with a new problem — how to visualize thousands of shopping tracks in a way that would be useful for our users as well as computationally scalable.\n\nFor our smaller customers, we were able to provide visualisations showing trajectories of each individual track on top of a floor plan. By inspecting these trajectories, they could explore patterns in the behaviour of shoppers. However, visualisations of larger numbers of tracks were difficult to read. Overlapping tracks were hard to distinguish and finding frequent shopping paths wasn’t easy for the users."
    },
    {
      "id": "digital-twins-retail-stores",
      "title": "Digital Twins of Retail Stores",
      "authors": "Matúš Tomlein",
      "context": "Pygmalios",
      "date": "2018-05-15",
      "banner": "blogs/digital-twins.jpg",
      "perex": " As a grad student, I worked on a research project that contributed to the Industry 4.0 initiative. Industry 4.0 builds on advancements in Cloud Computing, Cyber-Physical Systems and Internet of Things (IoT) to create smart factories with a high degree of automation, ability to self-adapt to changes over time and customise their behaviour to address specific user needs. One of the key building blocks of Industry 4.0 is the concept of Digital Twins.\n\n[Digital Twins](https://www.sciencedirect.com/science/article/pii/S2405896315003808) are models that enable a high-degree of awareness of physical processes and activities happening at factories in real-time. Such context-awareness can support a wide range of activities from production planning to maintenance and optimisation of production lines. Granular data from sensors placed around industrial systems supports simulation of their operation and prediction of future events. It can be used to predict future condition of industrial machines which enables their maintenance to be scheduled before it is too late. Awareness of events and processes that happen in factories is instrumental to the vision of smart factories."
    }
  ]
}
