{
  "publications": [
    {
      "id": "ar-modeling",
      "title": "Augmented Reality Supported Modeling of Industrial Systems to Infer Software Configuration",
      "authors": "Matúš Tomlein, Kaj Grønbæk",
      "venue": "PACM-HCI, EICS",
      "published": "June 2018",
      "date": "2018-06-01",
      "link": "https://dl.acm.org/citation.cfm?id=3229087",
      "abstract": "This paper proposes and evaluates an approach for building models of installed industrial Cyber-Physical Systems using augmented reality on smartphones. It proposes a visual language for annotating devices, containers, flows of liquids and networking connections in augmented reality. Compared to related work, it provides a more lightweight and flexible approach for building 3D models of industrial systems. The models are further used to automatically infer software configuration of controllable industrial products. This addresses a common problem of error-prone and time-consuming configuration of industrial systems in the current practice. The proposed approach is evaluated in a study with 16 domain experts. The study participants are involved in creating a model of an industrial system for water treatment. Their comments show that the approach can enable a less error-prone configuration for more complex systems. Opportunities for improvement in usability and reflections on the potential of the approach are discussed."
    },
    {
      "id": "iot-maintenance-transfer-learning",
      "title": "Supporting Maintenance Operations for IoT-based Activity Recognition using Transfer Learning",
      "authors": "Matúš Tomlein, Sudershan Boovaraghavan, Yuvraj Agarwal, Anind K. Dey",
      "venue": "Preprint",
      "published": "June 2018",
      "date": "2018-06-01",
      "link": "/papers/iot-maintenance-transfer-learning.pdf",
      "abstract": "Activity recognition is inherent to the vision of Internet-of-Things-enabled smart environments and enables end-users to perform activities of interest and have their smart environments respond appropriately. However as smart environments evolve and are expanded over time, the effort that end-users and others put into training their activity recognition models may be wasted, as those models degrade with these evolutions. This paper works on the problem of transferring activity recognition knowledge in the face of different maintenance or expansion operations, such as replacing a sensor or expanding activity recognition to a new room. We work with a novel sensing modality within smart homes, multi-sensor packages, which provide an integrated package that can sense a wide range of activities. Using a data collection from three spaces and 16 activities, we show that the maintenance and expansion operations have a varying effect on the performance of trained activity recognition models and identify a set of factors that influence it. Due to the large variance in performance of transferred models, we focus our contribution on preventing the transfer of models that would perform suboptimally in the changed setting. We propose an algorithm recommendation pipeline that makes use of meta-knowledge from previous maintenance operations to evaluate the transferability of different model representations through several steps. By adapting to different maintenance and expansion operations, the pipeline can save up to 53% of the effort to retrain activity recognition and filter out 94% of transfers with suboptimal performance. The adaptive choice of model representations improves upon using the same model representation by 0.14 F1 score on average."
    },
    {
      "id": "iot-visual-programming-configuration",
      "title": "A Visual Programming Approach Based on Domain Ontologies for Configuring Industrial IoT Installations",
      "authors": "Matúš Tomlein, Kaj Grønbæk",
      "venue": "IoT Conference",
      "published": "October 2017",
      "date": "2017-10-01",
      "link": "https://dl.acm.org/citation.cfm?doid=3131542.3131552",
      "abstract": "Industrial products tend to be customized by third-parties for different use cases. This is currently supported by adding external Programmable Logic Controllers (PLC) to installations. As IoT software ecosystems become wide-spread, the need for such hardware will decrease. However, removing the controllers opens the challenge of configuring distributed industrial installations. This paper argues for modeling application requirements on industrial installations so that they can be evaluated automatically based on information about targeted installations. GIMLE, a visual language for modeling application requirements using expressive domain knowledge, is proposed. GIMLE enables modeling requirements on physical features of installations, which hasn't received significant attention in the related work. A study with domain experts is used to reflect on the proposed process. The scalability of the visual language is evaluated using a model for a real-world application. The support for reuse of requirements enabled us to build models that can add support for new installations without significant changes and with a slower increase in size the more components can be reused."
    },
    {
      "id": "building-installation-models",
      "title": "Building Models of Installations to Recommend Applications in IoT Software Ecosystems",
      "authors": "Matúš Tomlein, Kaj Grønbæk",
      "venue": "FiCloud",
      "published": "August 2016",
      "date": "2016-08-01",
      "link": "http://ieeexplore.ieee.org/abstract/document/7575838/",
      "abstract": "Internet of Things devices are driven by applications. To stimulate innovation on their platforms, manufacturers of embedded products are creating software ecosystems that enable third-parties develop applications for their devices. Since such applications are developed externally, their seamless integration into the platforms is a challenge. In this paper, we propose to use semantic reasoning to select and configure applications in software ecosystems. Our prototype builds a model of the installation and the user goals through several steps. It processes application descriptions created by their developers and matches them to the installation model. Based on the matched descriptions, it presents options to deploy applications in the environment to the user sorted by their relevance. The proposed approach enables resolving complex requirements of applications before their installation in the platform. Our preliminary evaluation shows that the prototype supports the integration of the identified applications."
    },
    {
      "id": "semantic-iot-app-variability-model",
      "title": "Semantic Model of Variability and Capabilities of IoT Applications for Embedded Software Ecosystems",
      "authors": "Matúš Tomlein, Kaj Grønbæk",
      "venue": "WICSA",
      "published": "April 2016",
      "date": "2016-04-01",
      "link": "http://ieeexplore.ieee.org/abstract/document/7516835/",
      "abstract": "Applications in embedded open software ecosystems for Internet of Things devices open new challenges regarding how their variability and capabilities should be modeled. In collaboration with an industrial partner, we have recognized that such applications have complex constraints on the context. We have also identified a need to model their deployment topology and functionality in order to enable their seamless integration into the platform. In this paper, we draw from research in related fields and present a model of IoT applications. It is built using semantic annotations and uses semantic reasoning to resolve context requirements. We present the implications on the architecture of the ecosystem and the concepts defined in the model. Finally, we discuss the evaluation of the model and its benefits and liabilities. Although the approach results in more complex descriptions of applications, we conclude that it is suitable for modeling applications in IoT software ecosystems since it is more adaptable and expressive than the alternatives."
    },
    {
      "id": "novelty-recommendation",
      "title": "Method for Novelty Recommendation Using Topic Modelling",
      "authors": "Matúš Tomlein, Jozef Tvarožek",
      "venue": "UMAP Workshops",
      "published": "2014",
      "date": "2014-01-01",
      "link": "https://pdfs.semanticscholar.org/6dce/2e5eb87c8ff89353b1fb9a4dd1534d9aa878.pdf",
      "abstract": "Content-based filtering methods fall short in situations where there are many similar items to recommend from, for instance when recommending articles from multiple news portals. To deal with this problem, we can consider the novelty of recommendations. Detecting novelty is usually implemented as finding the most dissimilar articles. We propose a method that uses topic modelling to find the novelty of articles. Our method ranks topics by their importance and novelty to the user and recommends articles according to their topics. We evaluate our method and compare it to other approaches to novelty recommendation and also to a method that doesn’t take novelty into account. The results show that our method was more successful than the other approaches to novelty detection in recommending relevant articles that the users were interested in. It also showed a better click-through rate than the method that didn’t incorporate novelty, although the order of its recommendations was less optimal."
    },
    {
      "id": "ownet-slow-internet-proxy",
      "title": "Enhancing Web Surfing Experience in Conditions of Slow and Intermittent Internet Connection",
      "authors": "Ľuboš Demovič, Martin Konôpka, Marek Láni, Matúš Tomlein",
      "venue": "Bulletin of the ACM Slovakia",
      "published": "June 2012",
      "date": "2012-06-01",
      "link": "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.295.1744&rep=rep1&type=pdf",
      "abstract": "Despite of the advancements in information and telecommunication technologies, slow and intermittent Internet connection is still a serious issue in many places around the World, but mostly in developing countries. At the same time, Internet with its most popular service – the Web, became one of the very important parts of our everyday lives as more and more of human activity is taking place online. We believe that providing access to information on the Web is crucial for young people in developing countries to get the required skills and acquire experience in order to finally achieve significant progress in solving problems of their countries. In this paper, we propose a concept of software solution called OwNet which makes the Web surfing experience less frustrating even on slow and intermittent Internet connections. OwNet is based on using a local proxy server, which acts as an intelligent bridge between the client’s browser application and the Internet and communicates with other clients and services in order to provide the best surfing experience. Although this concept is not bound to the quality of available connection, we mainly target the current situation in developing countries. The paper presents the overall concept and details on methods used for intelligent caching and prefetching of Web content."
    }
  ]
}
